ch32-riscv-ug/ArduinoCore-CH32/cores/arduino/wiring_time.c
/* Clock setup and the millis/micros/delay family.
 *
 * Milestone 1 clocking (docs/todo.ja.md): internal oscillator only, no PLL.
 * F_CPU is the target HCLK and the AHB prescaler is *derived* from it, so a
 * different clock is a boards.txt change and nothing else - which is the whole
 * point, because the clock menu that comes later is then just more boards.txt
 * lines. A ratio the hardware cannot encode is a compile error rather than a
 * runtime surprise: a wrong HCLK shows up as garbled Serial output, since the
 * baud divisor is computed from F_CPU, and that is expensive to debug.
 */
#include "Arduino.h"
#include "ch32_clock.h"
#include "ch32_registers.h"
#ifndef CH32_CLOCK_INIT
#error "CH32_CLOCK_INIT is required (see build.clock_init in boards.txt)"
#endif
#include CH32_GENERATED_(CH32_CLOCK_INIT)

#ifndef CH32_FLASH_LATENCY
#error "CH32_FLASH_LATENCY is required (see build.core_defines in boards.txt)"
#endif

/* What SysTick counts. Every family but CH32V103 can be told to count HCLK;
 * V103 has no such bit and is fixed at HCLK/8. */
#if CH32_SYSTICK_V103
#define CH32_SYSTICK_HZ (F_CPU / 8u)
#if (F_CPU / 8u) < 1000000u
#error "F_CPU below 8 MHz leaves CH32V103's SysTick under 1 MHz, which micros() \
cannot divide by."
#endif
#else
#define CH32_SYSTICK_HZ (F_CPU)
#endif

#define CH32_TICKS_PER_MS ((uint32_t)(CH32_SYSTICK_HZ / 1000u))
#define CH32_TICKS_PER_US ((uint32_t)(CH32_SYSTICK_HZ / 1000000u))

static volatile uint32_t ch32_millis_counter;

void SystemInit(void)
{
    /* Put RCC back where reset leaves it before touching anything. This used
     * to be one line - enable HSI - on the theory that the rest was already at
     * its default. It is not: a program that ran before can leave HSE and the
     * PLL running, and reflashing does not clear them.
     *
     * That is not cosmetic. PLLSRC and PLLMULL are read-only while PLLON is
     * set, so the PLL configuration written below is silently ignored and the
     * part keeps whatever multiplier it already had. Measured on CH32V103: a
     * leftover HSE x9 survived, RCC->CFGR0's upper half never changed, and the
     * core ran at a frequency it had not chosen.
     *
     * The sequence is EVT's own and differs per family, so it is generated
     * (clock_init_<family>.h, from clock_init.csv). */
    /* Start from a known clock, whatever the last program left running. The
     * reset that brought us here is not necessarily a power-on: CH32.restart()
     * (a PFIC system-reset) and an IWDG watchdog reset both restart the core
     * WITHOUT resetting RCC on the V20x/V30x parts - measured on CH32V203,
     * where CFGR0 still reads SYSCLK-from-PLL after restart(). Left alone, the
     * generated reset macro below then clears PLLON while the PLL is still the
     * system clock, and the reconfiguration that follows lands on a glitched
     * clock - the UART came out ~1.25x fast and unstable, so the console was
     * unreadable after any software or watchdog reset.
     *
     * The fix is a specification, not a special case: bring SYSCLK to HSI and
     * confirm the switch (SWS) before touching anything else, every boot. HSI
     * is a valid source until we are off the PLL, so this is safe from the PLL
     * state too; and where we are already on HSI (a real power-on) both waits
     * fall straight through. From here the reset macro and the PLL bring-up
     * run from one fixed starting point regardless of what caused the reset. */
    CH32_RCC_CTLR |= CH32_RCC_CTLR_HSION;
    while ((CH32_RCC_CTLR & CH32_RCC_CTLR_HSIRDY) == 0u) {
    }
    CH32_RCC_CFGR0 = (CH32_RCC_CFGR0 & ~CH32_RCC_CFGR0_SW_MASK) |
                     CH32_RCC_CFGR0_SW_HSI;
    while ((CH32_RCC_CFGR0 & CH32_RCC_CFGR0_SWS_MASK) !=
           (CH32_RCC_CFGR0_SW_HSI << 2)) {
    }

    CH32_CLOCK_INIT_RESET();
    while ((CH32_RCC_CTLR & CH32_RCC_CTLR_HSIRDY) == 0u) {
    }

    /* Wait states first: the core comes out of reset on a divided clock, and
     * the prescaler below may raise it. Too few wait states at 48 MHz makes the
     * CPU fetch garbage - measured on CH32X035, which needs two and hangs
     * before setup() without them. Too many are merely slow, which is why
     * CH32_FLASH_LATENCY is sized for the family's fastest clock and left alone
     * when F_CPU asks for a slower one, and why setting it before the switch is
     * safe rather than after.
     *
     * Families whose flash needs no wait states have a zero mask and are not
     * touched at all: EVT never writes ACTLR on CH32V20x/V307/V407, so what
     * the low bits mean there is not established. */
#if CH32_FLASH_ACTLR_LATENCY_MASK
    CH32_FLASH_ACTLR = (CH32_FLASH_ACTLR & ~(uint32_t)CH32_FLASH_ACTLR_LATENCY_MASK) |
                       CH32_FLASH_LATENCY;
#endif

    /* Both APB prescalers stay at /1, so PCLK1 == PCLK2 == HCLK == F_CPU and
     * every peripheral divisor in this core can be computed from F_CPU alone.
     *
     * EVT does not do this: CH32V103/V20x/V30x/L103 set PPRE1=/2 at every PLL
     * frequency, /1 only at 24 MHz. That is exactly where STM32F1's 36 MHz
     * APB1 ceiling falls, and these families are STM32F1-shaped, whereas
     * CH32V205 (/1 to 192 MHz) and CH32V407 (/1 to 480 MHz) are not and do not
     * halve anything. The datasheets are unambiguous that /1 is in spec -
     * operating_conditions.csv gives F_PCLK1 max == F_HCLK max on every one of
     * them (CH32V103 80, CH32L103 96, CH32V20x and CH32V30x 144). So this
     * follows the datasheet rather than EVT.
     *
     * TODO(docs/todo.ja.md): confirm on hardware at 144 MHz, and ask upstream
     * why EVT halves it. If APB1 turns out to have a real ceiling, PCLK1 stops
     * being F_CPU and USART2-5, I2C, SPI2/3 and the APB1 timers each need
     * their own divisor - which is why this is worth settling before it
     * spreads. */
    CH32_RCC_CFGR0 &= ~(CH32_RCC_CFGR0_SW_MASK | CH32_RCC_CFGR0_HPRE_MASK |
                        CH32_RCC_CFGR0_PPRE1_MASK | CH32_RCC_CFGR0_PPRE2_MASK);
    CH32_RCC_CFGR0 |= CH32_RCC_CFGR0_SW_HSI |
                      CH32_RCC_CFGR0_HPRE(CH32_HPRE_FIELD);
    while ((CH32_RCC_CFGR0 & CH32_RCC_CFGR0_SWS_MASK) !=
           (CH32_RCC_CFGR0_SW_HSI << 2)) {
    }

/* The flag, not the value: CH32V30x_D8C encodes a x18 multiplier as field
 * 0 (RCC_PLLMULL18_EXTEN), so a zero PLL word is a real configuration. */
#if CH32_CLOCK_USE_PLL
    /* Some families gate the oscillator's path into the PLL from outside RCC:
     * CH32L103/V103/V205/V20x/V30x take HSI/2 unless EXTEN_PLL_HSI_PRE says
     * otherwise, and every HSI multiplier the tables list assumes the whole
     * oscillator. Without this, SYSCLK comes out at half. The register is not
     * even called the same thing on all of them (CH32V205 spells it CTLR0),
     * so its address arrives as a number rather than a name. */
#if CH32_CLOCK_EXTEN_ADDR
    CH32_REG32(CH32_CLOCK_EXTEN_ADDR) |= (uint32_t)CH32_CLOCK_EXTEN_BITS;
#endif
    CH32_RCC_CFGR0 = (CH32_RCC_CFGR0 & ~(uint32_t)CH32_CLOCK_PLL_MASK) |
                     (uint32_t)CH32_CLOCK_PLL_VALUE;
    CH32_RCC_CTLR |= CH32_RCC_CTLR_PLLON;
    while ((CH32_RCC_CTLR & CH32_RCC_CTLR_PLLRDY) == 0u) {
    }
    CH32_RCC_CFGR0 = (CH32_RCC_CFGR0 & ~CH32_RCC_CFGR0_SW_MASK) |
                     CH32_RCC_CFGR0_SW_PLL;
    while ((CH32_RCC_CFGR0 & CH32_RCC_CFGR0_SWS_MASK) !=
           (CH32_RCC_CFGR0_SW_PLL << 2)) {
    }
#endif

    /* 1 kHz tick off HCLK - or HCLK/8 on CH32V103, which cannot select. */
    CH32_SYSTICK_CTLR = 0u;
#if !CH32_SYSTICK_V103
    CH32_SYSTICK_SR = 0u;
#endif
#if CH32_SYSTICK_V103
    CH32_SYSTICK_WRITE8(0x04u, 0u);
    CH32_SYSTICK_WRITE8(0x08u, 0u);
    CH32_SYSTICK_WRITE8(0x0Cu, CH32_TICKS_PER_MS - 1u);
    CH32_SYSTICK_WRITE8(0x10u, 0u);
#else
    CH32_SYSTICK_CNT = 0u;
    CH32_SYSTICK_CMP = CH32_TICKS_PER_MS - 1u;
#if CH32_SYSTICK_64
    CH32_SYSTICK_CNT_HI = 0u;
    CH32_SYSTICK_CMP_HI = 0u;
#endif
#endif
    ch32_irq_enable(CH32_IRQN_SysTick);
#if CH32_SYSTICK_V103
    /* STE is the whole configuration here: the other two bits do not exist
     * (writing 0x7 reads back 0x1), the PFIC enable above is what lets the
     * match through, and the source is fixed. EVT's SYSTICK_Interrupt example
     * does exactly this. */
    CH32_SYSTICK_CTLR = CH32_SYSTICK_CTLR_STE;
#else
    CH32_SYSTICK_CTLR = CH32_SYSTICK_CTLR_STE | CH32_SYSTICK_CTLR_STIE |
                        CH32_SYSTICK_CTLR_STCLK;
#endif
}

/* TODO(docs/todo.ja.md): use the hardware auto-reload bit where the family has
 * one instead of rewinding the counter by hand. */
__attribute__((interrupt)) void SysTick_Handler(void)
{
#if CH32_SYSTICK_V103
    CH32_SYSTICK_WRITE8(0x04u, 0u);
    CH32_SYSTICK_WRITE8(0x08u, 0u);
#else
    CH32_SYSTICK_SR = 0u;
    CH32_SYSTICK_CNT = 0u;
#if CH32_SYSTICK_64
    CH32_SYSTICK_CNT_HI = 0u;
#endif
#endif
    ch32_millis_counter++;
}

unsigned long millis(void)
{
    return ch32_millis_counter;
}

/* ticks -> microseconds without a division. QingKe V2 (CH32V003, rv32ec) has
 * neither divide nor multiply in hardware, and the libgcc division in the
 * old `ticks / CH32_TICKS_PER_US` made every micros() call cost several
 * microseconds: delayMicroseconds() on the V003 ran 16-17 us long with
 * 9-15 us of jitter (2026-09-22, OEP capture), against +3 us on the X035.
 * Strip the power of two out of the divisor, then multiply by a rounded-up
 * reciprocal and shift; the compiler turns the constant multiply into a few
 * shifts and adds. Exact for every ticks value below one millisecond for all
 * divisors the families use (checked for 8..240 ticks per us); the static
 * assertions below pin the endpoints for the divisor actually built. */
#define CH32_US_DIV_K   (CH32_TICKS_PER_US % 16u == 0u ? 4u : CH32_TICKS_PER_US % 8u == 0u ? 3u : \
                         CH32_TICKS_PER_US % 4u == 0u ? 2u : CH32_TICKS_PER_US % 2u == 0u ? 1u : 0u)
#define CH32_US_DIV_ODD (CH32_TICKS_PER_US >> CH32_US_DIV_K)
#define CH32_US_DIV_S   (CH32_US_DIV_ODD <= 9u ? 16u : CH32_US_DIV_ODD <= 15u ? 18u : 19u)
#define CH32_US_DIV_R   (((1u << CH32_US_DIV_S) + CH32_US_DIV_ODD - 1u) / CH32_US_DIV_ODD)
/* The multiply by the reciprocal is spelled out per bit: GCC at -Os on rv32e
 * otherwise emits a __mulsi3 libcall for it (seen in the V003 disassembly),
 * which is the very cost this is meant to remove. Each `((R >> b) & 1)` is a
 * constant, so only the set bits of R survive as a shift and an add. */
#define CH32_MULC_BIT(x, R, b) (((R) >> (b)) & 1u ? ((uint32_t)(x) << (b)) : 0u)
#define CH32_MULC(x, R) (CH32_MULC_BIT(x, R, 0) + CH32_MULC_BIT(x, R, 1) + CH32_MULC_BIT(x, R, 2) + CH32_MULC_BIT(x, R, 3) + \
                         CH32_MULC_BIT(x, R, 4) + CH32_MULC_BIT(x, R, 5) + CH32_MULC_BIT(x, R, 6) + CH32_MULC_BIT(x, R, 7) + \
                         CH32_MULC_BIT(x, R, 8) + CH32_MULC_BIT(x, R, 9) + CH32_MULC_BIT(x, R, 10) + CH32_MULC_BIT(x, R, 11) + \
                         CH32_MULC_BIT(x, R, 12) + CH32_MULC_BIT(x, R, 13) + CH32_MULC_BIT(x, R, 14) + CH32_MULC_BIT(x, R, 15) + \
                         CH32_MULC_BIT(x, R, 16) + CH32_MULC_BIT(x, R, 17) + CH32_MULC_BIT(x, R, 18) + CH32_MULC_BIT(x, R, 19))
_Static_assert(CH32_US_DIV_R < (1u << 20), "reciprocal wider than the spelled-out multiply");
#define CH32_US_FROM_TICKS(t) (CH32_MULC((uint32_t)(t) >> CH32_US_DIV_K, CH32_US_DIV_R) >> CH32_US_DIV_S)
_Static_assert(CH32_US_FROM_TICKS(CH32_TICKS_PER_MS - 1u) == 999u, "ticks->us reciprocal off at the top of the millisecond");
_Static_assert(CH32_US_FROM_TICKS(CH32_TICKS_PER_US) == 1u && CH32_US_FROM_TICKS(CH32_TICKS_PER_US - 1u) == 0u,
               "ticks->us reciprocal off at one microsecond");
_Static_assert(CH32_US_FROM_TICKS(CH32_TICKS_PER_US * 500u - 1u) == 499u, "ticks->us reciprocal off at half a millisecond");

/* Wraps every 2^32 us (about 71 minutes), same as the AVR core. Differences
 * stay correct across the wrap because the arithmetic is modulo 2^32. */
unsigned long micros(void)
{
    uint32_t ms, ticks;

    do {
        ms = ch32_millis_counter;
        ticks = CH32_SYSTICK_CNT;
    } while (ms != ch32_millis_counter);

    return ms * 1000u + CH32_US_FROM_TICKS(ticks);
}

void delay(unsigned long ms)
{
    const uint32_t start = ch32_millis_counter;

    while ((uint32_t)(ch32_millis_counter - start) < (uint32_t)ms) {
        yield();
    }
}

void delayMicroseconds(unsigned int us)
{
    const uint32_t start = micros();

    while ((uint32_t)(micros() - start) < (uint32_t)us) {
    }
}

/* Weak so a sketch, or a cooperative scheduler, can take it over. delay()
 * calls it, which is the whole point: without the weak attribute a sketch that
 * defines its own yield() fails to link, and that is a contract several
 * libraries rely on. */
__attribute__((weak)) void yield(void)
{
}
